src/cf/Documents/CRM_КонтрольнаяТочкаПроекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Document>
		<Properties>
			<Name>CRM_КонтрольнаяТочкаПроекта</Name>
			<BasedOn>
				<xr:Item>Catalog.CRM_ЭтапыПроектов</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыВажностиВзаимодействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Comment>Дата закрытия </Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФакт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаВесьДень</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Comment>Свободное описание  точки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Comment>Описание результата закрытия точки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокУчастников</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Comment>Состояние контрольной точки</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_СтатусыКонтрольныхТочек</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Comment>Название контрольной точки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Этап</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ЭтапыПроектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПользователиКТ</Name>
					<Comment>Участники и ответственные по контрольной точке</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответственный</Name>
							<Comment>Признак ответственного за КТ</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Смещения</Name>
					<Comment>История смещения сроков КТ</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СмещениеДатаНачало</Name>
							<Comment>История смещенной даты</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СмещениеДатаОкончание</Name>
							<Comment>История смещений даты</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Comment>обязателен для заполнения</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Comment>Автор изменения</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Enums/CRM_СтатусыКонтрольныхТочек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Enum>
		<Properties>
			<Name>CRM_СтатусыКонтрольныхТочек</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запланирована</Name>
					<Comment>Используется при создании</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/CRM_КонтрольнаяТочкаПроекта/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ЗАПОЛНЕНИЯ ДОКУМЕНТА
#Область ПрограммныйИнтерфейс

// Процедура заполняет список участников мероприятия
//
// Параметры: Нет
//
Процедура ЗаполнитьСписокУчастников() Экспорт
	
	СписокУчастников = "";
	Для Каждого Участник Из ПользователиКТ Цикл
		СписокУчастников = СписокУчастников + ?(СписокУчастников = "","","; ") + Участник.Пользователь;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

Процедура ЗаполнитьРеквизитыПоУмолчанию()
	
	Статус 	 = Перечисления.CRM_СтатусыКонтрольныхТочек.Запланирована;
	Дата	 = ТекущаяДатаСеанса();

КонецПроцедуры

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	CRM_ОбщегоНазначенияСервер.ЗаполнитьШапкуДокумента(ЭтотОбъект, ДанныеЗаполнения);

	ЗаполнитьРеквизитыПоУмолчанию();
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Проекты") Тогда
		Проект = ДанныеЗаполнения;
		Подразделение = Проект.CRM_Подразделение;
		Этап = Проект.CRM_ТекущийЭтап;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.CRM_ЭтапыПроектов") Тогда
		Проект = ДанныеЗаполнения.Владелец;
		Подразделение = Проект.CRM_Подразделение;
		Этап = ДанныеЗаполнения;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("Подразделение") Тогда
			Подразделение = ДанныеЗаполнения.Подразделение;
		ИначеЕсли ДанныеЗаполнения.Свойство("Проект") И ЗначениеЗаполнено(ДанныеЗаполнения.Проект) Тогда
			Подразделение = ДанныеЗаполнения.Проект.CRM_Подразделение;
		ИначеЕсли ДанныеЗаполнения.Свойство("Этап") И ЗначениеЗаполнено(ДанныеЗаполнения.Этап) Тогда
			Этап = ДанныеЗаполнения.Этап;
			Проект = Этап.Владелец; 
			Подразделение = Проект.CRM_Подразделение;
		КонецЕсли;
		
		Если ДанныеЗаполнения.Свойство("Исполнитель") Тогда
			СтрокаПользователь = ПользователиКТ.Добавить();
			СтрокаПользователь.Пользователь = ДанныеЗаполнения.Исполнитель;
			Если  (ДанныеЗаполнения.Свойство("Проект") И ДанныеЗаполнения.Проект.Ответственный = ДанныеЗаполнения.Исполнитель) ИЛИ
				  (ДанныеЗаполнения.Свойство("Этап") И ДанныеЗаполнения.Этап.Ответственный = ДанныеЗаполнения.Исполнитель) Тогда
				СтрокаПользователь.Ответственный = Истина;
			КонецЕсли;
		КонецЕсли;

	ИначеЕсли НЕ ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Подразделение = CRM_ОбщегоНазначенияСервер.ТекущийПользователь().Подразделение;

	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	// Очистим табличные части и реквизиты.
	Смещения.Очистить();
	Описание	  = "";
	Результат	  = "";
	ДатаЗакрытия  = "";
	Автор 		  = CRM_ОбщегоНазначенияСервер.ТекущийПользователь();

	ЗаполнитьРеквизитыПоУмолчанию();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьСписокУчастников();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
